# Based on the output of `brew bundle dump` (which must be run outside of tmux).

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
tap "caskroom/fonts"
tap "homebrew/php"

brew "readline"
brew "abook"
brew "ack"
brew "ant"
brew "clasp"
brew "gringo"
brew "aspcud"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bdw-gc"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "libffi"
brew "glib"
brew "pixman"
brew "cairo"
brew "chruby"
brew "clipper", restart_service: true
brew "cloc"
brew "cloog"
brew "closure-compiler"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "dnsmasq", restart_service: true
brew "openssl"
brew "elinks"
brew "lame"
brew "perl"
brew "git"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "jpeg"
brew "libtiff"
brew "webp"
brew "gd"
brew "gdb"
brew "pkg-config"
brew "gobject-introspection"
brew "gdk-pixbuf"
brew "ghc"
brew "gifsicle"
brew "sqlite"
brew "gmime"
brew "gnu-sed", args: ["with-default-names"]
brew "libtasn1"
brew "nettle"
brew "gnutls"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gpg-agent"
brew "icu4c"
brew "harfbuzz"
brew "lua"
brew "highlight"
brew "htop-osx"
brew "httping"
brew "httrack"
brew "hub"
brew "unar"
brew "ievms"
brew "iftop"
brew "libtool"
brew "xz"
brew "imagemagick"
brew "imapfilter"
brew "isync", args: ["with-berkeley-db"]
brew "jq"
brew "json-c"
brew "lbdb"
brew "less"
brew "libcroco"
brew "libevent"
brew "pango"
brew "shared-mime-info"
brew "librsvg"
brew "libusb-compat"
brew "libvo-aacenc"
brew "libyaml"
brew "links"
brew "lockrun"
brew "python3"
brew "macvim"
brew "makedepend"
brew "mariadb"
brew "memcached", restart_service: true
brew "mldonkey"
brew "protobuf"
brew "mobile-shell"
brew "msmtp"
brew "tokyo-cabinet"
brew "mutt", args: ["HEAD"]
brew "neovim"
brew "nginx", restart_service: true
brew "node"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "ocaml"
brew "ocamlbuild"
brew "optipng"
brew "ossp-uuid"
brew "pandoc"
brew "par"
brew "pngquant"
brew "postgresql"
brew "potrace"
brew "pstree"
brew "pwgen"
brew "pyenv"
brew "qemu"
brew "qt"
brew "ragel"
brew "ranger"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rhino"
brew "ripgrep"
brew "ruby-install"
brew "s3cmd"
brew "shellcheck"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "urlview"
brew "utf8proc"
brew "v8"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "ykpers"
brew "zsh"
brew "homebrew/php/composer"
brew "homebrew/php/php71"

cask "alfred"
cask "contexts"
cask "fantastical"
cask "github-desktop"
cask "firefoxdeveloperedition"
cask "google-chrome-canary"
cask "hammerspoon"
cask "iterm2-nightly"
cask "messenger"
cask "omnifocus"
cask "skype"
cask "textual"
cask "transmission"
cask "vlc"
cask "vmware-fusion"
